In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()
import pymongo

In [2]:
avo_data= pd.read_csv('avocado_volume.csv')
avo_data.head()

,Date,California,Mexico,Chile,Dominican Republic,New Zealand,Peru,Total Volume in Pounds
0,1/4/2015,164520,29719045,718677,740000,270000,0,31612242
1,1/11/2015,928302,50455653,811149,870000,0,0,53065104
2,1/18/2015,2169628,50940292,1025090,1090000,0,0,55225010
3,1/25/2015,4229894,38183291,481359,2260000,0,0,45154544
4,2/1/2015,3232783,29998307,853528,1350000,0,0,35434618

In [4]:
new_avo_data_df = avo_data[['Date', 'Total Volume in Pounds']]
new_avo_data_df.set_index("Date", inplace=True)
new_avo_data_df = new_avo_data_df[:-1]
new_avo_data_df.head()

           Total Volume in Pounds
Date
1/4/2015                 31612242
1/11/2015                53065104
1/18/2015                55225010
1/25/2015                45154544
2/1/2015                 35434618

In [7]:
# connection_string = "root:@localhost/new_avo_imports_df"
engine = create_engine(f'mysql://root:@localhost/avocado_db')

In [8]:
engine.table_names()

['avocado_data', 'avocado_price']

In [9]:
new_avo_data_df.to_sql(name='avocado_data', con=engine, if_exists='append', index=True)

In [11]:
pd.read_sql_query('select * from avocado_data', con=engine).head()

        Date  Total Volume in Pounds
0   1/4/2015                31612242
1  1/11/2015                53065104
2  1/18/2015                55225010
3  1/25/2015                45154544
4   2/1/2015                35434618

         Date  AveragePrice region
0  2015-01-04             1   None
1  2015-01-11             1   None
2  2015-01-18             1   None
3  2015-01-25             1   None
4  2015-02-01             1   None